# CC_ReloadData

## Description
Reloads ConnectCAD data from the application, work group and user folder. Device database, signal types, connector types, cable options, cable types, custom cable lengths, jack field panel data, term panel data and custom Parameter files will be reloaded.

```pascal
PROCEDURE CC_ReloadData;
```

```python
def vs.CC_ReloadData():
    return None
```

## Examples
```pascal
CC_ReloadData;
```
```python
import vs

# Reloads ConnectCAD data from the application, work group and user folder.
vs.CC_ReloadData()
```

## Version
Availability: from Vectorworks 2023.4

## Category
* ConnectCAD